In [9]:
import pandas as pd

data = [{'name':'Surjeet', 'age':10 , 'A':'L'},
          {'name':'Sameer', 'age':11 , 'A':'K'},
          {'name':'Sumit', 'age':12 , 'A':'V'}]

df = pd.DataFrame(data)
print(df,'\n')

for index,row in df.iterrows():
    print(row['name'], row['age'], row['A'])

      name  age  A
0  Surjeet   10  L
1   Sameer   11  K
2    Sumit   12  V

Surjeet 10 L
Sameer 11 K
Sumit 12 V

In [17]:
import pandas as pd 

data = {'Name': ['Ankit', 'Amit',
                 'Aishwarya', 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce',
                   'Arts', 'Biology'],
        'Percentage': [88, 92, 95, 70]}

df = pd.DataFrame(data, columns=['Name','Age','Stream','Percentage'])
print(df,'\n')

for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [28]:
import pandas as pd 

data = {'Name': ['Ankit', 'Amit',
                 'Aishwarya', 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce',
                   'Arts', 'Biology'],
        'Percentage': [88, 92, 95, 70]}

df = pd.DataFrame(data,columns=['Name','Age','Stream','Percentage'])

print('Using loc function \n') 
for i in range(len(df)):
    print(df.loc[i][0], df.loc[i][2])
    
print('\n')


print('Using iloc function \n')
for i in range(len(df)):
    print(df.iloc[i][0],df.iloc[i][2])
    
print('\n')

Using loc function

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology


Using iloc function

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [29]:
import pandas as pd 

data = {'Name': ['Ankit', 'Amit', 'Aishwarya',
                 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce', 'Arts',
                   'Biology'],
        'Percentage': [88, 92, 95, 70]}

df = pd.DataFrame(data,columns=['Name','Age','Stream','Percentage'])

print("Given Dataframe :\n", df)

print("\nIterating over rows using apply function: \n")

print(df.apply(lambda row:row["Name"] + " " + str(row["Percentage"]), axis=1))

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using apply function:

0        Ankit 88
1         Amit 92
2    Aishwarya 95
3     Priyanka 70
dtype: object

In [42]:
import pandas as pd

record = {

 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }

# create a dataframe
df = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])

df[(df['Stream']!='Math') & (df['Stream']!='Commerce')]

        Name  Age   Stream  Percentage
2  Aishwarya   20  Science          95
5    Shaurya   21  Science          78

In [44]:
import pandas as pd

df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'], 
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'], 
                    'Cost':[10000, 5000, 15000, 2000]})

Row_list=[]

for i in range((df.shape[0])):
    Row_list.append(list(df.iloc[i,:]))
    
print(Row_list[:3])

[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000]]

In [53]:
import pandas as pd  
    
# Define a dictionary containing employee data  
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],  
        'Age':[27, 24, 22, 32],  
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}  
    
df = pd.DataFrame(data)

# for i in range(1,3):
#     print(df.loc[i]['Name'], df.loc[i]['Qualification'])

print(df.loc[1:3 , ['Name','Qualification']])

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [54]:
import pandas as pd  
    
# Define a dictionary containing employee data  
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],  
        'Age':[27, 24, 22, 32],  
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

df=pd.DataFrame(data)

print(df.loc[0,['Address','Age','Name','Qualification']])

Address          Delhi
Age                 27
Name               Jai
Qualification      Msc
Name: 0, dtype: object

In [57]:
import pandas as pd  
    
# Define a dictionary containing employee data  
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],  
        'Age':[27, 24, 22, 32],  
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

df=pd.DataFrame(data)

print(df.loc[0:1 , ['Age', 'Name']])

   Age    Name
0   27     Jai
1   24  Princi

In [60]:
#M-2 
import pandas as pd  
    
# Define a dictionary containing employee data  
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],  
        'Age':[27, 24, 22, 32],  
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 

df = pd.DataFrame(data)

print(df.iloc[0:2,1:3])

   Age Address
0   27   Delhi
1   24  Kanpur

In [61]:
#https://www.geeksforgeeks.org/drop-rows-from-the-dataframe-based-on-certain-condition-applied-on-a-column/?ref=next_article
#Imp link for applying conditions on column by droping rows
# filtered_df = df[df['Age']>=25]
#print(filtered_df.head(10))

# indexAge = df[([df['Age'] >=20) & (df['Age']<=25)].index
# df.drop(indexAge, inplace=True)
# df.head(15)

In [67]:
import pandas as pd

data = {'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
        'age': [25, 30, 35, 40],
        'gender': ['F', 'M', 'M', 'M']}
df = pd.DataFrame(data)

df_new = df.loc[df['age']<=30]

print(df_new)

    name  age gender
0  Alice   25      F
1    Bob   30      M

In [5]:
import pandas as pd 

data = {'name':['Simon','Marsh','Gaurav','Alex','Selena'],
       'Maths': [8,5,6,9,7],
       'Science':[7,9,5,4,7],
       'English':[7,4,7,6,8]}

df = pd.DataFrame(data)

a=df.sort_values(by='Science', ascending =0)
print("Sorting rows by Science:\n \n",a)

Sorting rows by Science:

      name  Maths  Science  English
1   Marsh      5        9        4
0   Simon      8        7        7
4  Selena      7        7        8
2  Gaurav      6        5        7
3    Alex      9        4        6

In [7]:
import pandas as pd 

data = {'English':[4,7,8,7,6],
       'Maths':[5,6,7,8,9],
       'Science':[9,5,7,7,4],
       'name':['Marsh','Gaurav','Selena','Simon','Alex']}

df = pd.DataFrame(data)

b = df.sort_values(by=['Maths', 'English'])
print(b)

   English  Maths  Science    name
0        4      5        9   Marsh
1        7      6        5  Gaurav
2        8      7        7  Selena
3        7      8        7   Simon
4        6      9        4    Alex

In [8]:
# importing pandas and numpy
import pandas as pd
import numpy as np
 
# data of 2018 drivers world championship
dict1 = {'Driver': ['Hamilton', 'Vettel', 'Raikkonen',
                    'Verstappen', 'Bottas', 'Ricciardo',
                    'Hulkenberg', 'Perez', 'Magnussen',
                    'Sainz', 'Alonso', 'Ocon', 'Leclerc',
                    'Grosjean', 'Gasly', 'Vandoorne',
                    'Ericsson', 'Stroll', 'Hartley', 'Sirotkin'],
 
         'Points': [408, 320, 251, 249, 247, 170, 69, 62, 56,
                    53, 50, 49, 39, 37, 29, 12, 9, 6, 4, 1],
 
         'Age': [33, 31, 39, 21, 29, 29, 31, 28, 26, 24, 37,
                 22, 21, 32, 22, 26, 28, 20, 29, 23]}
 
# creating dataframe using DataFrame constructor
df = pd.DataFrame(dict1)
print(df.head(10))

       Driver  Points  Age
0    Hamilton     408   33
1      Vettel     320   31
2   Raikkonen     251   39
3  Verstappen     249   21
4      Bottas     247   29
5   Ricciardo     170   29
6  Hulkenberg      69   31
7       Perez      62   28
8   Magnussen      56   26
9       Sainz      53   24

In [9]:
df.describe()

           Points        Age
count   20.000000  20.000000
mean   106.050000  27.550000
std    121.893601   5.345682
min      1.000000  20.000000
25%     24.750000  22.750000
50%     51.500000  28.000000
75%    189.250000  31.000000
max    408.000000  39.000000

In [10]:
print(df.max())

Driver    Vettel
Points       408
Age           39
dtype: object

In [11]:
df[df.Points==df.Points.max()]

     Driver  Points  Age
0  Hamilton     408   33

In [12]:
df[df.Age==df.Age.max()]

      Driver  Points  Age
2  Raikkonen     251   39

In [13]:
print(df.min())

Driver    Alonso
Points         1
Age           20
dtype: object

In [14]:
df[df.Points==df.Points.min()]

      Driver  Points  Age
19  Sirotkin       1   23

In [15]:
df[df.Age==df.Age.min()]

    Driver  Points  Age
17  Stroll       6   20

In [18]:
import pandas as pd 

df = pd.DataFrame({'Name': ['Geeks', 'Peter', 'James', 'Jack', 'Lisa'], 
                   'Team': ['Boston', 'Boston', 'Boston', 'Chele', 'Barse'], 
                   'Position': ['PG', 'PG', 'UG', 'PG', 'UG'], 
                   'Number': [3, 4, 7, 11, 5], 
                   'Age': [33, 25, 34, 35, 28], 
                   'Height': ['6-2', '6-4', '5-9', '6-1', '5-8'], 
                   'Weight': [89, 79, 113, 78, 84], 
                   'College': ['MIT', 'MIT', 'MIT', 'Stanford', 'Stanford'], 
                   'Salary': [99999, 99994, 89999, 78889, 87779]}, 
                   index =['ind1', 'ind2', 'ind3', 'ind4', 'ind5'])

# print(df,"\n")

print("Check PG values in Position column:\n")
df1 = df['Position'].str.contains("PG")
print(df1)

Check PG values in Position column:

ind1     True
ind2     True
ind3    False
ind4     True
ind5    False
Name: Position, dtype: bool

In [19]:
df1 = df[df['Position'].str.contains("PG")]
print(df1)

       Name    Team Position  Number  Age Height  Weight   College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89       MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79       MIT   99994
ind4   Jack   Chele       PG      11   35    6-1      78  Stanford   78889

In [22]:
df1 = df[df['Team'].str.contains("Boston") | df['Team'].str.contains("MIT")]
print(df1)

       Name    Team Position  Number  Age Height  Weight College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89     MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79     MIT   99994
ind3  James  Boston       UG       7   34    5-9     113     MIT   89999

In [23]:
df2 = df[df["Team"].str.contains("Boston") & df["Position"].str.contains("PG")]
print(df2)

       Name    Team Position  Number  Age Height  Weight College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89     MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79     MIT   99994

In [24]:
df3 = df[df["Position"].str.contains("PG") & df["College"].str.contains("UC")]
print(df3)

Empty DataFrame
Columns: [Name, Team, Position, Number, Age, Height, Weight, College, Salary]
Index: []

In [27]:
# Import pandas package
import pandas as pd
  
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select all columns
df.sample()

     Name  Age Address Qualification
1  Princi   24  Kanpur            MA

In [31]:
df.sample(3)

    Name  Age  Address Qualification
4  Geeku   15    Noida          10th
3   Anuj   32  Kannauj           Phd
0    Jai   27    Delhi           Msc

In [33]:
df.sample(frac = 0.5)

     Name  Age    Address Qualification
4   Geeku   15      Noida          10th
2  Gaurav   22  Allahabad           MCA

In [34]:
#How to print an entire pandas dataframe in python 
# ->to.string()
# ->pd.option_context()

In [35]:
#display(df.to_string())